
#+STARTUP: overview
#+AUTHOR: Kinney
* 索引
  + [[未来记录]]
  + [[月度记录]]
  + [[每日记录]]
  + [[《子弹笔记》]]
    
* 未来记录
  ● 实现bujo-mode
  ● 学驾照
  ● 学习lsp-mode
  ● 学习magit
  ● 阅读10本书

* 月度记录
** 2月
   | Date  | 日历页            | 任务页           |
   |-------+-------------------+------------------|
   | 1 五  | ○ 高三同学聚餐    | > [[*毕业设计][毕设网站框架]]   |
   | 2 六  |                   | × 使用bujo.org   |
   | 3 日  |                   | > 学习Vue.js     |
   | 4 一  |                   | ● 学习emacs lisp |
   | 5 二  | ○ 春节            | > [[*Feb 12 Tue][设计bujo-mode]]  |
   | 6 三  |                   |                  |
   | 7 四  |                   |                  |
   | 8 五  |                   |                  |
   | 9 六  |                   |                  |
   | 10 日 | ○ bujo结合orgmode |                  |
   | 11 一 |                   |                  |
   | 12 二 |                   |                  |
   | 13 三 |                   |                  |
   | 14 四 |                   |                  |
   | 15 五 |                   |                  |
   | 16 六 |                   |                  |
   | 17 日 |                   |                  |
   | 18 一 |                   |                  |
   | 19 二 |                   |                  |
   | 20 三 |                   |                  |
   | 21 四 |                   |                  |
   | 22 五 |                   |                  |
   | 23 六 |                   |                  |
   | 24 日 | ○ 开学            |                  |
   | 25 一 |                   |                  |
   | 26 二 |                   |                  |
   | 27 三 |                   |                  |
   | 28 四 |                   |                  |

* 每日记录
** 2月
*** Feb 10 Sun
    × 学习bujo
       × 整理bujo笔记
       × 摘录bujo好句
    × bujo结合orgmode

*** Feb 11 Mon
     > 整理《子弹笔记》“实践”章节笔记
     > 运用bootstrap搭建毕设框架
     × 完善bujo.org细节
	× 使用org-pomodoro
	× 完善内部链接跳转
	× 思考其他bujo与org的结合
	× 取消orgmode的代码缩进设置
     > org与omnifocus结合
     > 设计bujo-mode
     > 定期备份bujo.org

     - 事情复杂到一定程度时，单独形成一个集子
     - 专业性的笔记不记录在bujo中
     - 每天精力有限，把最好的精力用在最重要的事情上

*** Feb 12 Tue
    :LOGBOOK:
    CLOCK: [2019-02-12 Tue 11:34]--[2019-02-12 Tue 11:42] =>  0:08
    CLOCK: [2019-02-12 Tue 11:05]--[2019-02-12 Tue 11:07] =>  0:02
    :END:
    > 整理《子弹笔记》“实践”章节笔记
    > org与omnifocus结合
    > org mode绘图
    × 定期备份bujo.org
    × 学习Vue.js
    > [[设计bujo-mode]]
    < [[未来记录][实现bujo-mode]]

    - 记录daily log时考察三部分：脑中所想，昨日记录，月度记录

*** Feb 13 Wed
    :LOGBOOK:
    CLOCK: [2019-02-13 Wed 11:00]--[2019-02-13 Wed 11:12] =>  0:12
    :END:
    > 整理《子弹笔记》“实践”章节笔记
    × 学习Vue.js
    > 折腾emacs
       +org-mode 绘图+
       +org-mode结合omnifocus+
       > 学习magit
    > [[设计bujo-mode][学习minor mode设计思路]]

*** Feb 14 Thu
    > 整理《子弹笔记》“实践”章节笔记
    × 学习Vue.js(day1,day2)
    > 学习magit
    > 练歌：离家最近的路
    > 学习lsp-mode

*** Feb 15 Fri
    > 学习vue.js(day3,day4)
    × 整理《子弹笔记》“实践”章节笔记
    > 练歌：离家最近的路
    > 学习lsp-mode
    > 学习magit

*** Feb 16 Sat
    > 学习vue.js(day4,day5)
    × 整理《子弹笔记》“实践”章节笔记
    × 练歌：离家最近的路

    - 确定一天中最重要的事情，评估所用时间安排任务，其余任务，想法放到未来记录中。关注点放在最重要的事情上！

*** Feb 17 Sun
    × 学习vue.js
    × 整理《子弹笔记》

*** Feb 18 Mon
    × 学习vue.js
    > 整理完《子弹笔记》
    × 阅读《杀死一只知更鸟》

*** Feb 19 Tue
    × 学习Vue.js (4◔)
    > 编写毕设页面 (4◔)
    × 整理完《子弹笔记》(1◔)
    × 阅读《杀死一知更鸟》(1◔)
    ✪ switch游戏 (3◔,B20)

    ─ 设计自己的奖励机制，任务完成时给予成就感
    ─ 给任务加上时间的限制，以番茄钟为时间单位(1个番茄始终=40min)

*** Feb 20 Wed
    ● 编写毕设页面 (4◔)
    × 学习vue.js (3◔)
    ● 阅读《杀死一只知更鸟》(1◔)
    ✪ 王者荣耀 (2◔)

* 阅读记录
  × 月亮与六便士 2019.02
  × 子弹笔记 2019.02
  ● 杀死一只知更鸟 2019.02

* 读书笔记
** 《子弹笔记》
   :LOGBOOK:
   CLOCK: [2019-02-11 Mon 22:20]--[2019-02-11 Mon 22:24] =>  0:04
   :END:
   #+NAME: 《子弹笔记》
   - 理论
     - 子弹短句分为三类：任务(Task，需要做的事情), 事件(Event，你的经历), 笔记(Note，不想遗忘的信息)
     - 任务子弹分类：任务(●), 完成的任务(x), 迁移的任务(>), 计划中的任务(<), 不想关的任务(+划去+)
     - 事件子弹：用“○”表示，简明客观的记录即将发生或已经发生的事件，方便日后回顾与解决问题
     - 笔记子弹：用“-”表示，当某件事情有重要或有趣的细节值得记录时使用
     - 优先符号：用“★”表示，用于标注重要的子弹短句，常于任务子弹搭配
     - 灵感符号：用"!"标注笔记子弹，表明这条笔记让我产生了想法，思考或见解，供后续整理
     - 集子：模块化的集子解决混乱。子弹笔记的四个核心集子：每日记录，月度记录，未来记录，索引
     - 每日记录：快速记录一天的任务，事件，笔记，让思想减负
     - 月度记录：分为日历页和任务页，日历页是事件发生的时间轴，任务页梳脑中所有思绪
     - 未来记录：每日记录中有未来之事迁移到未来记录中，月度记录的时候查看未来记录进行迁移
     - 月度迁移：回顾上月任务未完成情况，分成4中情况：1.舍弃 2.重新抄写 3.迁移到个性化集子 4.迁移到未来记录
     - 年度迁移：回顾上一年的未完成情况，考察迁移那些项目，集子

   - 实践
     - 反思：日反思规划，夜反思回顾。
     - 意义：很多人把追求快乐当作人生目标，事实上快乐不可占有。当你达成某个目标或者得到你想要的生活后，你的快速适应会让你觉得平淡无奇，快乐感逐渐消退。快乐只是一种情绪，是我们着手进行其他目标时的结果。我们更应该关注怎么做，即寻找生活的意义。观察那些让你产生好奇心，那些“大放光芒”的事物，这些事物有可能具有意义。寻找这些事物的本质。
     - 目标：带意向的设定目标，目标的灵感可以来源与激情之源。创建目标集子，设定期限，分清主次，划去不必要的目标。分解长期目标为冲刺目标，分解前头脑风暴，每日反思 ，即时修正。
     - 循序渐进：实现目标的过程不要期待巨变，要持续改善。

   - 好句摘录
     - 如果生活是大海，那么其中的每一天就像海浪一样，有的震撼，有的普通。子弹笔记就像海岸，在每一天的影响下得到雕琢。
     - 若没能把想法积极的运用到生活中，就算是最强烈的信仰，最有益的经验也会消散。
     - 无论一项行动有多么简单，其背后都蕴含了无数选择。
     - 眼睛只能看到光亮，耳朵只能听到声音，而一颗聆听的心却能感知到意义。
     - 好奇心是我们在看到某种潜能时产生的触电般的兴奋劲。好奇心点亮幻想与惊讶，就像磁铁一样，把我们从封闭的自我中拉出来，融入世界中，它超越理智、欲望、个人利益，甚至是快乐。
     - 享乐效应指当前环境的改变给人带来快乐时，人们通常会很快适应环境的改变，恢复到平常的快乐程度。
     - 快乐是我们着手进行其他目标时的结果。如果快乐是行为的结果，那我们就不该问自己如何才能快乐了。相反，我们该问问自己，要怎么做。
     - 作家克托尔.加西亚曾说：“你的ikigai即是你擅长的事，又是你热衷的事”。多年来，人们用许多不同的字眼和实践来描述这一点，但都殊途同归的回到生活意义的核心。
     - 感受那些“大放光芒”的事物，这些事物有可能具有意义。
     - 如果不带意向的胡乱设定目标，目标就有可能沦落为我们在遭遇龌蹉或悲痛时下意识的反应。
     - 获得干劲的一大妙招就是意识到时间有限。
     - 目标的灵感启发应当源自自身的生活经历。不论是带给你欢乐的积极动力还是带给你悲惨教训的生活苦难，你的生活中肯定有真正的激情之源。把这些经历运用起来，这些都是强有力的意义源泉，你可以从中找到有意义的目标。
     - 宏大的目标往往费时又费力，在这一路上你会面对各种挑战，耐力常常是你最狡猾最致命的对手。因此，要实现宏大的目标，常常需要切实的需求看来激励自己度过数日，数月，甚至数年的风风雨雨。这项需求必须足够强劲，才能抵御一路上的分心、借口和疑惑。
     - 这个世界上有天真的问题，乏味的问题，用词不当的问题，自我批评不足提出的问题。但每一次发问都是为了了解世界。这世界上没有愚蠢的问题。
* 设计bujo-mode
  :LOGBOOK:
  CLOCK: [2019-02-12 Tue 12:26]--[2019-02-12 Tue 13:38] =>  1:12
  CLOCK: [2019-02-12 Tue 11:47]--[2019-02-12 Tue 12:20] =>  0:33
  :END:
  × 学习minor mode设计思路
  ● 查阅lip reference manual
  ● 研究org-agenda代码 

  - bujo-agenda
     - F:bujo-agenda-future-view 未来记录(Future Log)
     - M:bujo-agenda-month-view 月度记录(Monthly Log)
     - D:bujo-agenda-ady-view 每日记录(Daily Log)
     - a:bujo-agenda-task-abort
     - d:bujo-agenda-task-done => × (done)
     - m:bujo-agenda-task-migrated => > (migrated)
       - task状态变为“>”
       - 选择要迁移到的日期或新集子
     - s:bujo-agenda-task-sheculed => < (schedule)
       - task状态变为“<”
       - 在未来记录中添加该task
     - n:bujo-agenda-next-line
     - p:bujo-agenda-previous-line
     - f:bujo-agenda-later
     - b:bujo-agenda-earlier
     - .:bujo-agenda-goto-today
     - j:bujo-agenda-goto-date
     - r:bujo-agenda-refresh
     - Tab bujo-agenda-goto
     - q:bujo-agenda-quit
     - x:bujo-agenda-exit
  - bujo-agenda-file
     - 自动生成特定格式的bujo.org
     - 解析bujo.org, 实现bujo.org和bujo agenda的双向动态更新
  - bujo-select
     - keybinding: C-c b
       | Select a capture template |
       |---------------------------|
       | [t]  Task                 |
       | [e]  Event                |
       | [n]  Note                 |
  - point
     - bujo-select选择t的时候将窗口分成左右两列，左边默认为bujo-agenda，显示昨天的记录，方便迁移
     - 只有task状态可变。自动对task的状态进行排序，依次为：todo-migrated-scheduled-done-abort，r刷新
     - bujo-agenda打开的默认展示为当天的Daily Log，分为三类：task, event, note
       - n, p上下移动；task可改变状态：t(todo), m(migrate), s(scheduled), d(done), a(abort)
       - f, b向前向后切换记录，“.”回到当天记录，j调用日历跳转到指定日期的日记录
     - 按键M显示月度记录页，分三列
       | Date  | Event    | Task    |
       |-------+----------+---------|
       | 1 Wes | ○ thing1 | ● task1 |
       | 2 Thu | ○ thing2 | ● task2 |
       | 3 Fri | ○ thing3 |         |
       | 4 Sta |          |         |
       | 5 Sun |          |         |
       | ..... | .....    | .....   |
       - 同理n,p,f,b,.,j,t,m,s,d,a
     - 按键F显示未来记录, 简单的task列表
* 我所做的微小的改善
  - 上厕所不玩手机，阅读kindle
